app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "English"], ["updated_at", "2019-12-18 20:58:12.159173"], ["id", 3]]
---
    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_class_params)